PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_tsi.c
/*!
    \file    gd32f3x0_hal_tsi.c
    \brief   TSI driver

    \version 2023-08-01, V1.0.0, HAL firmware for GD32F3x0
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#if defined(GD32F350)

#include "gd32f3x0_hal.h"

static uint32_t _hals_used_groups(uint32_t channel_pins);

/*!
    \brief      initialize TSI
    \param[in]  tsi_dev: TSI device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  tsi_init: the pointer of TSI init structure
                  charge_time:
                  only one parameter can be selected which is shown as below:
      \arg          TSI_CHARGE_xCTCLK (x = 1...16): charge state duration time
                  transfer_time:
                  only one parameter can be selected which is shown as below:
      \arg          TSI_TRANSFER_xCTCLK (x = 1...16): charge transfer state duration time
                ctclk_div:
                only one parameter can be selected which is shown as below:
      \arg          TSI_CTCDIV_DIV1: fCTCLK = fHCLK
      \arg          TSI_CTCDIV_DIV2: fCTCLK = fHCLK/2
      \arg          TSI_CTCDIV_DIV4: fCTCLK = fHCLK/4
      \arg          TSI_CTCDIV_DIV8: fCTCLK = fHCLK/8
      \arg          TSI_CTCDIV_DIV16: fCTCLK = fHCLK/16
      \arg          TSI_CTCDIV_DIV32: fCTCLK = fHCLK/32
      \arg          TSI_CTCDIV_DIV64: fCTCLK = fHCLK/64
      \arg          TSI_CTCDIV_DIV128: fCTCLK = fHCLK/128
      \arg          TSI_CTCDIV_DIV256: fCTCLK = fHCLK/256
      \arg          TSI_CTCDIV_DIV512: fCTCLK = fHCLK/512
      \arg          TSI_CTCDIV_DIV1024: fCTCLK = fHCLK/1024
      \arg          TSI_CTCDIV_DIV2048: fCTCLK = fHCLK/2048
      \arg          TSI_CTCDIV_DIV4096: fCTCLK = fHCLK/4096
      \arg          TSI_CTCDIV_DIV8192: fCTCLK = fHCLK/8192
      \arg          TSI_CTCDIV_DIV16384: fCTCLK = fHCLK/16384
      \arg          TSI_CTCDIV_DIV32768: fCTCLK = fHCLK/32768
                seq_max:
                only one parameter can be selected which is shown as below:
      \arg          TSI_MAXNUM255: the max cycle number of a sequence is 255
      \arg          TSI_MAXNUM511: the max cycle number of a sequence is 511
      \arg          TSI_MAXNUM1023: the max cycle number of a sequence is 1023
      \arg          TSI_MAXNUM2047: the max cycle number of a sequence is 2047
      \arg          TSI_MAXNUM4095: the max cycle number of a sequence is 4095
      \arg          TSI_MAXNUM8191: the max cycle number of a sequence is 8191
      \arg          TSI_MAXNUM16383: the max cycle number of a sequence is 16383
                extend_charge_state:
                only one parameter can be selected which is shown as below:
      \arg          TSI_EXTEND_CHARGE_DISABLE: extend charge state disable
      \arg          TSI_EXTEND_CHARGE_ENABLE: extend charge state enable
                ecclk_div: extend charge clock(ecclk) division factor
      \arg          TSI_EXTEND_DIV1: fECCLK = fHCLK
      \arg          TSI_EXTEND_DIV2: fECCLK = fHCLK/2
      \arg          TSI_EXTEND_DIV3: fECCLK = fHCLK/3
      \arg          TSI_EXTEND_DIV4: fECCLK = fHCLK/4
      \arg          TSI_EXTEND_DIV5: fECCLK = fHCLK/5
      \arg          TSI_EXTEND_DIV6: fECCLK = fHCLK/6
      \arg          TSI_EXTEND_DIV7: fECCLK = fHCLK/7
      \arg          TSI_EXTEND_DIV8: fECCLK = fHCLK/8
                extend_charge_time: 1~128
                pin_mode:
      \arg          TSI_OUTPUT_LOW: TSI pin will output low when IDLE
      \arg          TSI_INPUT_FLOATING:  TSI pin will keep input_floating when IDLE
                edge_sel:
      \arg          TSI_FALLING_TRIGGER: falling edge trigger TSI charge transfer sequence
      \arg          TSI_RISING_TRIGGER:  rising edge trigger TSI charge transfer sequence
                trig_mode:
      \arg          TSI_HW_TRIGGER_DISABLE: hardware trigger disable
      \arg          TSI_HW_TRIGGER_ENABLE: hardware trigger enable
                 sample_pins:
                 one or more parameters can be selected which are shown as below:
      \arg          TSI_GxPy(x=0..5,y=0..3), pin y of group x
                 channel_pins:
                 one or more parameters can be selected which are shown as below:
      \arg          TSI_GxPy(x=0..5,y=0..3), pin y of group x
                 shield_pins:
                 one or more parameters can be selected which are shown as below:
      \arg          TSI_GxPy(x=0..5,y=0..3), pin y of group x
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_tsi_init(hal_tsi_dev_struct *tsi_dev, hal_tsi_init_struct *tsi_init)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == tsi_dev) || (NULL == tsi_init)) {
        HAL_DEBUGE("pointer [*tsi_dev] or pointer [*tsi_init] address is invalid");
        /* return function state */
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    tsi_dev->state = HAL_TSI_STATE_BUSY;

    /* tsi param config */
    /* configure charge pulse and transfer pulse */
    hals_tsi_pulse_config(tsi_init->ctclk_div, tsi_init->charge_time, tsi_init->transfer_time);
    /* configure the max cycle number of a charge-transfer sequence */
    hals_tsi_max_number_config(tsi_init->seq_max);
    /* configure extend charge state */
    hals_tsi_extend_charge_config((ControlStatus) tsi_init->extend_charge_state, tsi_init->ecclk_div,
                                  tsi_init->extend_charge_time);
    /* TSI IO pin will output low or keep input_floating when IDLE  */
    hals_tsi_pin_mode_config(tsi_init->pin_mode);
    /* set hardware trigger mode */
    hals_tsi_hardware_mode_config(tsi_init->edge_sel);
    /* TSI trigger mode select */
    TSI_CTL0 &= ~TSI_CTL0_TRGMOD;
    TSI_CTL0 |= tsi_init->trig_mode;
    /* switch off hysteresis function of channel */
    TSI_PHM = ~(tsi_init->sample_pins | tsi_init->channel_pins | tsi_init->shield_pins);
    /* sample pin config */
    TSI_SAMPCFG = (tsi_init->sample_pins);
    /* channel and shield pin config */
    TSI_CHCFG = (tsi_init->channel_pins | tsi_init->shield_pins);
    /* Group config */
    TSI_GCTL = _hals_used_groups(tsi_init->channel_pins);

    /* disable interrupts and clear flags */
    TSI_INTEN &= (~(TSI_INTEN_CTCFIE | TSI_INTEN_MNERRIE));
    TSI_INTC |= (TSI_INTF_CTCF | TSI_INTF_MNERR);

    /* enable TSI module */
    TSI_CTL0 |= TSI_CTL0_TSIEN;

    /* change TSI error state */
    tsi_dev->error_state = HAL_TSI_ERROR_NONE;
    /* change TSI state */
    tsi_dev->state = HAL_TSI_STATE_READY;

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      initialize the TSI structure with the default values
    \param[in]  hal_struct_type: the argument could be selected from enumeration <hal_tsi_struct_type_enum>
    \param[out]  p_struct: pointer to TSI structure that contains the configuration information
    \retval     none
*/
void hal_tsi_struct_init(hal_tsi_struct_type_enum hal_struct_type, void *p_struct)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == p_struct) {
        HAL_DEBUGE("pointer [*p_struct] value is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

