PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_tsi.c
    switch(hal_struct_type) {
    case HAL_TSI_INIT_STRUCT:
        /* initialize TSI initialization structure with the default values */
        ((hal_tsi_init_struct *)p_struct)->charge_time                 = TSI_CHARGE_1CTCLK;
        ((hal_tsi_init_struct *)p_struct)->transfer_time               = TSI_TRANSFER_1CTCLK;
        ((hal_tsi_init_struct *)p_struct)->ctclk_div                   = TSI_CTCDIV_DIV1;
        ((hal_tsi_init_struct *)p_struct)->seq_max                     = TSI_MAXNUM255;
        ((hal_tsi_init_struct *)p_struct)->extend_charge_state         = TSI_EXTEND_CHARGE_DISABLE;
        ((hal_tsi_init_struct *)p_struct)->ecclk_div                   = TSI_EXTEND_DIV1;
        ((hal_tsi_init_struct *)p_struct)->extend_charge_time          = TSI_EXTENDMAX(0);
        ((hal_tsi_init_struct *)p_struct)->pin_mode                    = TSI_OUTPUT_LOW;
        ((hal_tsi_init_struct *)p_struct)->edge_sel                    = TSI_FALLING_TRIGGER;
        ((hal_tsi_init_struct *)p_struct)->trig_mode                   = TSI_HW_TRIGGER_DISABLE;
        ((hal_tsi_init_struct *)p_struct)->sample_pins                 = 0U;
        ((hal_tsi_init_struct *)p_struct)->channel_pins                = 0U;
        ((hal_tsi_init_struct *)p_struct)->shield_pins                 = 0U;
        break;
    case HAL_TSI_IRQ_STRUCT:
        /* initialize TSI initialization structure with the default values */
        ((hal_tsi_irq_struct *)p_struct)->tsi_cctcf_handle             = NULL;
        ((hal_tsi_irq_struct *)p_struct)->tsi_mnerr_handle             = NULL;
        break;
    case HAL_TSI_DEV_STRUCT:
        /* initialize TSI initialization structure with the default values */
        ((hal_tsi_dev_struct *)p_struct)->tsi_irq.tsi_cctcf_handle     = NULL;
        ((hal_tsi_dev_struct *)p_struct)->tsi_irq.tsi_mnerr_handle     = NULL;
        ((hal_tsi_dev_struct *)p_struct)->error_state                  = HAL_TSI_ERROR_NONE;
        ((hal_tsi_dev_struct *)p_struct)->state                        = HAL_TSI_STATE_NONE;
        ((hal_tsi_dev_struct *)p_struct)->mutex                        = HAL_MUTEX_UNLOCKED;
        ((hal_tsi_dev_struct *)p_struct)->priv                         = NULL;
        break;
    default:
        HAL_DEBUGW("parameter [hal_struct_type] value is undefine");
        break;
    }
}

/*!
    \brief      deinitialize TSI device structure and init structure
    \param[out]  tsi_dev: TSI device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_tsi_deinit(hal_tsi_dev_struct *tsi_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == tsi_dev) {
        HAL_DEBUGE("pointer [tsi_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    tsi_dev->state = HAL_TSI_STATE_BUSY;
    /* deinit TSI */
    hal_rcu_periph_reset_enable(RCU_TSIRST);
    hal_rcu_periph_reset_disable(RCU_TSIRST);

    /* change TSI error state and state */
    tsi_dev->error_state = HAL_TSI_ERROR_NONE;
    tsi_dev->state = HAL_TSI_STATE_RESET;

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      start TSI module function
    \param[in]  tsi_dev: TSI device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_tsi_start(hal_tsi_dev_struct *tsi_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == tsi_dev) {
        HAL_DEBUGE("pointer [tsi_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    tsi_dev->state = HAL_TSI_STATE_BUSY;

    /* disable interrupts and clear flags */
    TSI_INTEN &= ~(TSI_INTEN_CTCFIE | TSI_INTEN_MNERRIE);
    TSI_INTC |= (TSI_INTF_CTCF | TSI_INTF_MNERR);

    /* set gpio pin mode to output low when idle */
    hals_tsi_pin_mode_config(TSI_OUTPUT_LOW);
    /* start a charge-transfer sequence */
    TSI_CTL0 |= TSI_CTL0_TSIS;

    tsi_dev->state = HAL_TSI_STATE_READY;

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      stop tsi module function
    \param[in]  tsi_dev: TSI device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_tsi_stop(hal_tsi_dev_struct *tsi_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == tsi_dev) {
        HAL_DEBUGE("pointer [tsi_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* stop a charge-transfer sequence */
    TSI_CTL0 &= ~TSI_CTL0_TSIS;
    /* set gpio pin mode to output low when idle */
    hals_tsi_pin_mode_config(TSI_OUTPUT_LOW);
    /* clear flags */
    TSI_INTC |= (TSI_INTF_CTCF | TSI_INTF_MNERR);

    tsi_dev->state = HAL_TSI_STATE_READY;

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      start TSI interrupt
    \param[in]  tsi_dev: TSI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: TSI interrupt callback function structure
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_tsi_start_interrupt(hal_tsi_dev_struct *tsi_dev, hal_tsi_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == tsi_dev) || (NULL == p_irq)) {
        HAL_DEBUGE("pointer [tsi_dev] or pointer [p_irq] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    /* lock TSI */
    HAL_LOCK(tsi_dev);
    tsi_dev->state = HAL_TSI_STATE_BUSY;
    tsi_dev->tsi_irq.tsi_cctcf_handle = p_irq->tsi_cctcf_handle;
    tsi_dev->tsi_irq.tsi_mnerr_handle = p_irq->tsi_mnerr_handle;

